def task1():
    slovar = {'Великобритания': 'Лондон', 'Ирландия': 'Дублин', 'Германия': 'Берлин', 'Нидерланды': 'Амстердам', 'Бельгия': 'Брюссель', 'Франция': 'Париж', 'Монако': 'Монако', 'Австрия': 'Вена', 'Дания': 'Копенгаген', 'Исландия': "Рейкьявик", 'Финляндия': 'Хельсинки', 'Швеция': 'Стокгольм', 'Норвегия': 'Осло', 'Эстония': 'Таллин', 'Латвия': 'Рига'}
    for key in sorted(slovar):
        print(key, " - ", slovar[key])
    a = input("Назовите страну:")
    for key in slovar:
        if a == key:
            print("Столица: ", slovar[key])
    else:
        print("Нет такой страны!")


def task2():
    erudite = {1: ['А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т'], 2: ['Д', 'К', 'Л', 'М', 'П', 'У'], 3: ['Б', 'Г', 'Ё', 'Ь', 'Я'], 4: ['Й', 'Ы'], 5: ['Ж', 'З', 'Х', 'Ц', 'Ч'], 8: ['Ш', 'Э', 'Ю'], 10 :['Ф', 'Щ', 'Ъ']}
    word = input("Ввидите слово")
    word = word.upper()
    word1 = list(word)
    s = 0
    for i in erudite:
        for a in erudite[i]:
            if a in word1:
                col = 0
                for b in word1:
                    if b == a:
                        col +=1
                        s += (i*col)
    print(s)


def task3():
    sp = {"Иванов": ["Русский", "Английский"], "Петров": ["Русский", "Английский", "Немецкий"], "Смирнов": ["Китайский", "Английский", "Немецкий"], "Попов": ["Китайский", "Французский", "Немецкий"], "Лебедев": ["Русский", "Французский", "Японский"]}
    lang = []
    st = []
    for i in sp:
        for a in sp[i]:
            lang.append(a)

    print("Студенты знают: ", len(set(lang)), " различных языков")
    lang_sort = list(set(lang))
    print("Языки, которые изучают студенты: ", *sorted(lang_sort))

    for i in sp:
        for a in sp[i]:
            if a == "Китайский":
                st.append(i)
    print("Знают китайский язык: ", *st)


task1()
task2()
task3()